examples/compressionRamp_2D/case/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| ShockLens compressionRamp_2D : laminar Mach 2, 15 deg corner, Re_L=1e4         |
\*---------------------------------------------------------------------------*/
FoamFile { version 2.0; format ascii; class volVectorField; object U; }
dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (2 0 0);
boundaryField
{
    inlet   { type fixedValue; value uniform (2 0 0); }
    outlet  { type zeroGradient; }
    bottom  { type noSlip; }
    top     { type slip; }
    frontAndBack { type empty; }
}
