examples/compressionRamp_2D/case/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| ShockLens compressionRamp_2D : laminar Mach 2, 15 deg corner, Re_L=1e4         |
\*---------------------------------------------------------------------------*/
FoamFile { version 2.0; format ascii; class volScalarField; object p; }
dimensions      [1 -1 -2 0 0 0 0];
internalField   uniform 1;
boundaryField
{
    inlet   { type fixedValue; value uniform 1; }
    outlet  { type zeroGradient; }
    bottom  { type zeroGradient; }
    top     { type zeroGradient; }
    frontAndBack { type empty; }
}
