examples/compressionRamp_2D/case/Allrun
#!/bin/sh
cd "${0%/*}" || exit
. "${WM_PROJECT_DIR:?}/bin/tools/RunFunctions"
runApplication blockMesh
runApplication checkMesh
runApplication rhoCentralFoam
runApplication foamToVTK
